@extends('layouts.SNS')

{{--@section('title', '피드 통계')--}}
@section('content')
    <div>
        <h6>
            써클인컴퍼니 개인정보 취급방침<br>
            <br>
            (주)써클인컴퍼니(이하 “회사”라 합니다)는 전기통신사업법, 전자상거래 등에서의 소비자보호에 관한 법률, 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 통신비밀보호법 등 정보통신서비스 제공자가 준수하여야 할 관련 법령상의 개인정보취급 규정을 준수하며, 관련 법령에 의거한 개인정보취급방침을 정하여 이용자 권익 보호에 최선을 다하고 있습니다.<br>
            (주)써클인컴퍼니은 기존 인터넷 서비스들의 관습적인 정보수집에 반대하며, 이용자를 위하여 반드시 필요한 최소한의 정보만을 수집하여 필요한 기간까지 안전하게 보호하고 이후 안전하게 파기하는 것을 개인정보취급방침의 핵심으로 두고 있습니다.<br>
            (주)써클인컴퍼니의 개인정보취급방침은 다음과 같은 내용을 담고 있습니다.<br>
            1. 수집하는 개인정보의 항목 및 수집방법<br>
            2. 개인정보의 수집 및 이용목적<br>
            3. 개인정보 공유 및 제공<br>
            4. 개인정보 처리의 위탁<br>
            5. 개인정보의 보유 및 이용기간<br>
            6. 개인정보 파기절차 및 방법<br>
            7. 이용자 및 법정대리인의 권리와 의무 및 행사방법<br>
            8. 개인정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항<br>
            9. 개인정보의 기술적/관리적 보호 대책<br>
            10. 개인정보관리책임자 및 담당자의 연락처<br>
            11. 고지의 의무<br>
            ​<br>
            1. 수집하는 개인정보의 항목 및 수집방법<br>
            1) 수집하는 개인정보의 항목<br>
            이용자는 회원가입을 하지 않아도 센터 검색, 컨텐츠 보기 등의 서비스를 회원과 동일하게 이용할 수 있습니다.<br>
            (1) 회원가입 시 수집하는 항목: 성명, 생년월일, 성별, 이메일, 유선전화번호, 휴대전화번호, 자택주소, 운동종목, 이용시설, 운동목적, 사진정보, 마케팅수신동의여부<br>
            (2) 서비스 이용과정에서 생성 및 수집되는 항목: 결제정보 및 내역, 서비스 이용기록, 단말기명, OS버전, 시설이용기록, UDID, 접속로그, 쿠키, 접속 IP정보, 불량이용기록,위치정보<br>
            (3) 이용자의 선택에 의해 수집하는 항목: 이벤트 응모 등의 진행 및 사은품 배송을 위한 정보<br>
            2) 개인정보 수집방법<br>
            (1) 홈페이지, 서면양식, 팩스, 전화, 상담 게시판, 이메일, 이벤트 응모<br>
            (2) 제휴시설로부터의 제공<br>
            2. 개인정보의 수집 및 이용목적<br>
            1) 서비스 제공에 관한 계약 이행<br>
            서비스 이용을 위한 콘텐츠 제공, 물품배송, 본인인증 및 금융서비스를 통한 서비스 결제<br>
            2) 회원관리<br>
            회원제 서비스 이용에 따른 본인확인, 개인식별, 불량회원의 부정 이용 방지와 비인가 사용방지, 가입의사 확인, 가입 및 가입횟수 제한, 연령확인, 분쟁 조정을 위한 기록보존, 불만처리 등 민원처리, 고지사항 전달<br>
            3) 서비스 개발 및 마케팅 광고에의 활용<br>
            맞춤 서비스 제공 및 신규 서비스 개발, 인구통계학적 특성에 따른 서비스 제공 및 광고 게재, 신/인기 상품 홍보, 이벤트/광고성 정보 제공과 참여기회 제공, 접속 빈도 파악 또는 회원 서비스 이용에 대한 통계/분석을 통한 마케팅 자료로서 회원 취향에 맞는 최적의 서비스를 제공<br>
            3. 개인정보의 공유 및 제공<br>
            회사는 원칙적으로 이용자의 개인정보를 외부에 제공하지 않습니다. 다만, 아래의 경우는 예외로 합니다.<br>
            (1) 이용자들이 사전에 공개에 동의한 경우<br>
            (2) 전기통신기본법, 전기통신사업법 등 관계 법령의 규정에 의거하거나, 수사목적으로 법령에 정해진 절차와 방법에 따라 수사기관의 요구가 있는 경우<br>
            4. 개인정보 처리의 위탁<br>
            회사는 수집된 개인정보의 처리 및 관리 등의 업무를 스스로 수행함을 원칙으로 하나, 필요한 경우 업무의 일부 또는 전부를 업체에 위탁할 수 있으며 위탁업체의 세부내용은 당사나 제휴사의 서비스 홈페이지의 ‘개인정보처리방침’을 통해 확인할 수 있습니다.<br>
            5. 개인정보의 보유 및 이용기간<br>
            (주)써클인컴퍼니은 개인정보의 수집 및 제공받은 목적이 달성되면 지체없이 개인정보를 파기함을 원칙으로 합니다. 다만, 다음 각 호의 경우 일정기간 동안 예외적으로 수집한 회원정보의 전부 또는 일부를 보관할 수 있습니다.<br>
            1) 보유 기간을 미리 고지하고 별도의 동의를 받은 경우 해당 보유기간까지 보유<br>
            2) 소멸시효가 남은 상사채권(멤버십, 상품권 등)을 이용자가 보유하고 있는 경우 시효 만료 시점까지 보유<br>
            3) 전자상거래 등에서의 소비자 보호에 관한 법률 및 상법 등 관계법령에 따라 일정기간 보유할 필요가 있는 경우, 관계 법령이 정한 기간에 따라 보유<br>
            - 계약 또는 청약철회 등에 관한 기록 : 5년<br>
            - 대금결제 및 재화 등의 공급에 관한 기록 : 5년<br>
            - 소비자의 불만 또는 분쟁처리에 관한 기록 : 3년<br>
            - 게시판 이용자의 본인확인에 관한 기록: 6개월<br>
            6. 개인정보 파기절차 및 방법<br>
            이용자의 개인정보는 원칙적으로 개인정보의 수집 및 이용목적이 달성되면 지체 없이 파기합니다. 파기절차 및 방법은 다음과 같습니다.<br>
            1) 파기절차<br>
            회사는 이용자가 회원탈퇴를 신청하는 경우, 소비자의 불만 및 분쟁해결 등을 위한 목적으로 30일간 개인정보를 보관 한 후, 재생이 불가능한 방법으로 파기합니다.<br>
            2) 파기방법<br>
            (1) 종이에 출력된 개인정보 및 접수된 서류는 분쇄하거나 소각을 통해 파기합니다.<br>
            (2) 전자적 파일형태로 저장된 개인정보 : 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제합니다.<br>
            7. 이용자 및 법정대리인의 권리와 의무 및 행사방법<br>
            이용자는 회사에 대해 언제든지 다음 각 호의 개인정보 보호 관련 권리를 행사할 수 있습니다.<br>
            (1) 개인정보 열람요구<br>
            (2) 오류 등이 있을 경우 정정 요구<br>
            (3) 삭제요구<br>
            (4) 처리정지 요구<br>
            (5) 제 1항에 따른 권리 행사는 회사에 대해 서면, 전화, 전자우편, 모사전송(FAX) 등을 통하여 하실 수 있으며 회사는 이에 대해 지체없이 조치하겠습니다.<br>
            (6) 이용자가 개인정보의 오류 등에 대한 정정 또는 삭제를 요구한 경우에는 회사는 정정 또는 삭제를 완료할 때까지 당해 개인정보를 이용하거나 제공하지 않습니다.<br>
            (7) 만 14세 미만 아동의 경우, 제 1항에 따른 권리 행사는 이용자의 법정대리인이나 위임을 받은 자 등 대리인을 통하여 하실 수 있습니다. 이 경우, 법정대리인은 이용자의 모든 권리를 가집니다.<br>
            (8) 이용자는 정보통신망법, 개인정보보호법 등 관계법령을 위반하여 회사가 처리하고 있는 이용자 본인이나 타인의 개인정보 및 사생활을 침해하여서는 아니됩니다.<br>
            8. 개인정보 자동 수집 장치의 설치/운영 및 거부에 관한 사항<br>
            (1) 회사는 이용자에게 특화된 맞춤서비스 등을 제공하기 위해서 회원의 정보를 수시로 저장하고 찾아내는 ‘쿠키(Cookie, 접속정보파일)’을 운용합니다. 쿠키란 웹사이트를 운영하는 서버가 이용자의 브라우저 또는 앱에 보내는 아주 작은 텍스트 파일로써 이용자의 컴퓨터 또는 디바이스에 저장됩니다. 회사는 쿠키 운용 시 개인 식별을 최소화 하고 있습니다.<br>
            (2) 이용자는 ‘쿠키’에 대한 선택권을 가지고 있습니다. 이용자는 웹 브라우저에서 [도구] > [인터넷옵션] > [보안] > [사용자정의수준]을 선택하거나, 모바일 기기 설정 또는 옵션에서 설정함으로써 모든 쿠키를 허용하거나, 쿠키가 저장될 때 마다 확인을 거치거나, 아니면 모든 쿠키의 저장을 거부할 수 있습니다. 단, 모든 쿠키의 저장을 거부하는 경우, 쿠키를 통해 회사에서 제공하는 서비스를 이용할 수 없습니다.<br>
            (3) Google Analytics를 활용하여 이용자의 서비스 이용에 대해 분석합니다. Google Analytics는 이용자의 사이트 활용 방식을 이해하는데 도움을 주는 웹로그 분석 도구입니다. 개별 이용자의 개인 정보를 식별하지 않고 익명의 사용자 정보를 활용하여 웹사이트 사용 통계를 보고하기 위해 쿠키를 사용할 수 있습니다.<br>
            9. 개인정보의 기술적/관리적 보호 대책<br>
            회사는 이용자들의 개인정보를 취급함에 있어 개인정보가 분실, 도난, 누출, 변조 또는 훼손되지 않도록 안전성 확보를 위하여 다음과 같은 기술적/관리적 대책을 강구하고 있습니다.<br>
            1) 기술적 대책<br>
            (1) 회사는 이용자의 비밀번호, 고유식별정보 외에 이메일 주소와 휴대폰 번호 등을 추가로 암호화 하여 보관하고 있으며, 개인정보 확인 및 변경은 본인의 요청을 통해서만 가능합니다.<br>
            (2) 회사는 암호화 통신을 통해 네트워크 상에서 개인정보를 안전하게 전송할 수 있도록 하고 있습니다.<br>
            (3) 회사는 해킹이나 컴퓨터바이러스 등에 의해 이용자의 개인정보가 유출되거나 훼손되는 것을 막기 위해 최선을 다하고 있습니다.<br>
            (4) 회사는 만약의 사태를 대비하여 개인정보를 주기적으로 백업하고 있으며, 백신프로그램을 이용하여 컴퓨터바이러스에 의한 피해를 방지하기 위한 조치를 취하고 있습니다.<br>
            (5) 회사는 시스템에 대한 접근통제, 권한관리, 취약점 점검 등의 조치를 통해 보안성이 강화될 수 있도록 지속적으로 노력하고 있습니다.<br>
            2) 관리적 대책<br>
            (1) 회사는 이용자의 개인정보에 대한 접근권한을 최소한의 인원으로 제한하고 있으며, 그 최소한의 인원에 해당하는 자는 다음과 같습니다.<br>
            - 이용자를 직접 상대로 하여 마케팅, 이벤트, 고객지원, 게임운영, 배송업무를 수행하는 자 (위탁, 협력 업체 직원 포함)<br>
            - 개인정보보호책임자 등 개인정보관리업무를 수행하는 자<br>
            - 기타 업무상 개인정보 처리가 불가피한 자<br>
            (2) 회사는 개인정보취급자와 수탁자를 대상으로 개인정보 보호 의무 등에 관해 정기적인 교육을 실시하고 있습니다.<br>
            (3) 회사는 개인정보보호 업무를 전담하는 부서에서 개인정보처리방침 및 내부 규정 준수여부를 확인하여 문제가 발견될 경우, 즉시 바로잡을 수 있도록 노력하고 있습니다.<br>
            (4) 회사가 개인정보처리자로서 의무를 다하였음에도 불구하고, 이용자 본인의 부주의나 회사가 관리하지 않는 영역에서의 사고 등 회사의 귀책에 기인하지 않은 손해에 대해서는 회사는 책임을 지지 않습니다.<br>
            10. 개인정보관리책임자의 연락처<br>
            이용자는 회사의 서비스를 이용하는 과정에서 발생하는 모든 개인정보보호 관련 민원을 개인정보관리 책임자 혹은 담당부서로 신고할 수 있습니다.<br>
            회사는 이용자들의 신고사항에 대해 신속하게 답변을 드릴 것입니다.<br>
            개인정보 관리 책임자<br>
            - 이름 : 최현우<br>
            - 소속 : 본부<br>
            - 직위 : CEO<br>
            - 전화 : 02-2135-9752<br>
            - 메일 : jhone@circlin.co.kr<br>
            <br>
            11. 고지의 의무<br>
            본 개인정보 처리방침은 2019년 6월 20일에 제정되었으며, 법령/정책 또는 보안기술의 변경에 따라 내용의 추가, 삭제 및 수정이 있을 시에는 변경되는 개인정보 처리방침을 시행하기 최소 7일 전에 (주)써클인컴퍼니 인터넷사이트를 통해 변경이유 및 내용 등을 공지하도록 하겠습니다.<br>
            <br><br><br>
        </h6>
        </div>
{{--    <table>--}}
{{--        <thead>--}}
{{--        <tr>--}}
{{--            <th>전체 피드 수</th>--}}
{{--            <th>금일 작성 피드 수</th>--}}
{{--            <th>금주 작성 피드 수</th>--}}
{{--            <th>금월 작성 피드 수</th>--}}
{{--        </tr>--}}
{{--        </thead>--}}
{{--        <tbody>--}}
{{--        <tr>--}}
{{--            <td>{{ number_format($feeds_count['all']) }}</td>--}}
{{--            <td>{{ number_format($feeds_count['day']) }}</td>--}}
{{--            <td>{{ number_format($feeds_count['week']) }}</td>--}}
{{--            <td>{{ number_format($feeds_count['month']) }}</td>--}}
{{--        </tr>--}}
{{--        </tbody>--}}
{{--    </table>--}}
{{--    <br>--}}
{{--    <br>--}}
{{--    <br>--}}
{{--    <a href="{{ route('admin.feed.index', Arr::collapse([request()->all(), ['filter' => 'all']])) }}" class="btn">전체</a>--}}
{{--    <a href="{{ route('admin.feed.index', Arr::collapse([request()->all(), ['filter' => 'day']])) }}" class="btn">금일</a>--}}
{{--    <a href="{{ route('admin.feed.index', Arr::collapse([request()->all(), ['filter' => 'week']])) }}" class="btn">금주</a>--}}
{{--    <a href="{{ route('admin.feed.index', Arr::collapse([request()->all(), ['filter' => 'month']])) }}" class="btn">금월</a>--}}
{{--    <br>--}}
{{--    <br>--}}
{{--    <br>--}}
{{--    <form action="{{ route('admin.feed.index') }}">--}}
{{--        <input type="hidden" name="filter" value="{{ $filter }}">--}}
{{--        <select name="type">--}}
{{--            <option value="all" {{ $type === 'all' ? 'selected' : '' }}>전체 (닉네임, 이메일, 미션명)</option>--}}
{{--        </select>--}}
{{--        <input name="keyword" type="text" placeholder="검색 내용을 입력해주세요." value="{{ $keyword }}">--}}
{{--        <button>검색</button>--}}
{{--    </form>--}}
{{--    <br>--}}
{{--    <p style="font-size: 20px">검색 결과 : <b>{{ number_format($feeds->total()) }}</b> 개</p>--}}
{{--    <br>--}}
{{--    <table>--}}
{{--        <thead>--}}
{{--        <tr>--}}
{{--            <th style="width: 100px" rowspan="2">ID</th>--}}
{{--            <th style="width: 300px" rowspan="2">이미지</th>--}}
{{--            <th style="width: auto" rowspan="2">내용</th>--}}
{{--            <th style="width: 120px" rowspan="2">카테고리</th>--}}
{{--            <th style="width: 300px">미션명</th>--}}
{{--            <th style="width: 200px">작성자</th>--}}
{{--            <th style="width: 150px" rowspan="2">작성일</th>--}}
{{--        </tr>--}}
{{--        </thead>--}}
{{--        <tbody>--}}
{{--        @forelse($feeds as $feed)--}}
{{--            <tr>--}}
{{--                <td rowspan="{{ max(count($feed->missions), 1) }}" class="center">--}}
{{--                    {{ $feed->id }}--}}
{{--                    <br>{{ $feed->is_hidden ? '🔒︎' : '' }}--}}
{{--                </td>--}}
{{--                <td rowspan="{{ max(count($feed->missions), 1) }}">--}}
{{--                    @foreach($feed->images as $image)--}}
{{--                        @if($image->type === 'image')--}}
{{--                            <img src="{{ $image->image }}" alt="" width="100%">--}}
{{--                        @else--}}
{{--                            <video src="{{ $image->image }}" width="100%" height="300px" controls></video>--}}
{{--                        @endif--}}
{{--                    @endforeach--}}
{{--                </td>--}}
{{--                <td rowspan="{{ max(count($feed->missions), 1) }}">--}}
{{--                    {!! nl2br($feed->content) !!}--}}
{{--                </td>--}}
{{--                @if(count($feed->missions) > 0)--}}
{{--                    <td>{{ $feed->missions[0]->emoji }} {{ $feed->missions[0]->category }}</td>--}}
{{--                    <td>{{ $feed->missions[0]->title }}</td>--}}
{{--                @else--}}
{{--                    <td colspan="2" class="center">미션이 없습니다.</td>--}}
{{--                @endif--}}
{{--                <td rowspan="{{ max(count($feed->missions), 1) }}">{{ $feed->nickname }}<br>({{ $feed->email }})</td>--}}
{{--                <td rowspan="{{ max(count($feed->missions), 1) }}" class="center">{{ $feed->created_at }}</td>--}}
{{--            </tr>--}}
{{--            @foreach($feed->missions as $mission)--}}
{{--                @if($loop->first) @continue @endif--}}
{{--                <tr>--}}
{{--                    <td>{{ $mission->emoji }} {{ $mission->category }}</td>--}}
{{--                    <td>{{ $mission->title }}</td>--}}
{{--                </tr>--}}
{{--            @endforeach--}}
{{--        @empty--}}
{{--            <tr>--}}
{{--                <td colspan="0" class="center">피드가 없습니다.</td>--}}
{{--            </tr>--}}
{{--        @endforelse--}}
{{--        </tbody>--}}
{{--    </table>--}}
{{--    <br>--}}
{{--    <div class="center">{{ $feeds->withQueryString()->links() }}</div>--}}
@endsection
